Revit 2027 API
LoadBase.IsHosted Property
 Indicates if the Load is hosted or non-hosted.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsHosted { get; }
Public ReadOnly Property IsHosted As Boolean
	Get
public:
property bool IsHosted {
	bool get ();
}
member IsHosted : bool with get
Property Value
Boolean
Remarks
 True is returned when load is hosted. False is returned load is non-hosted. To determine if load is hosted HostElementId property.
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace